Repository: Jehxon/MorseTrainer
Catalog: lib/l10n/app_*.arb
Languages: fr

# dictPath
source: assets/data/english_dict_freq.txt
fr: assets/data/french_dict_freq.txt

source: Cancel
fr: Annuler

source: Confirm
fr: Valider

source: Give up
fr: Abandonner

# listenButton
source: Listen
fr: Écouter

# nbSuccessiveGoodGuesses
source: Current score
fr: Score

source: Highscore
fr: Meilleur score

# guessLetterTitle
source: Find the letter
fr: Quelle est cette lettre ?

# guessSoundTitle
source: Find the sound of the letter
fr: Quel son fait cette lettre ?

# pressButton
source: Press here !
fr: Appuyez ici !

# guessWordTitle
source: Find the word
fr: Quel est ce mot ?

# generalParameters
source: General
fr: Général

# themeParameter
source: Change theme
fr: Changer le thème

# playBackSpeedParameter
source: Playback speed
fr: Vitesse de lecture des lettres

# soundFrequencyParameter
source: Sound pitch (Hz)
fr: Fréquence des sons (Hz)

# includeNumbersAndSpecialCharactersParameter
source: Include numbers and special characters
fr: Inclure les nombres et caractères spéciaux

# numberOfGuesses
source: Number of choices
fr: Nombre de propositions

# showLetterSound
source: Show sound pattern
fr: Afficher le motif du son

# nbWordsParameter
source: Number of words in the dictionary
fr: Nombre de mots dans le dictionnaire

# nbWordsParameterSubtitle1
source: The words are chosen among the
fr: Les mots proposés sont les

# nbWordsParameterSubtitle2
source: most frequent words in the english language.
fr: mots les plus fréquents dans la langue française.

# tempoBetweenLetters
source: Tempo between 2 letters
fr: Temps entre 2 lettres

# tempoBetweenLettersSubtitle
source: One tempo is the time of a '•'. One '-' lasts 3 tempos. Increase this if you have trouble knowing when a letter ends. Default value is 3.
fr: Un temps est le temps d'un '•'. Un '-' dure 3 temps. La valeur par défaut est 3.

# pickColor
source: Pick a color
fr: Choix de la couleur

source: Parameters
fr: Paramètres

# previousPage
source: Go back
fr: Précédent
